export const ru = {
    ru: {
        translation: {
            AuthPage: {
                signInToAccount: 'Войти в свой аккаунт',
                signUp: 'Регистрация'
            },
            EmailVerificationPage: {
                title: 'Подтвердите свой адрес электронной почты',
                text: 'На вашу электронную почту отправлено письмо. Пожалуйста, подтвердите его, чтобы завершить регистрацию.',
                goToHome: 'Перейти на главную',
                resendEmailText: 'Не получили письмо?',
                resendEmail: 'Отправить еще раз',
                emailSent: 'Письмо отправлено',
                emailSendError: 'Ошибка отправки письма'
            },
            FollowingPage: {
                title: 'Подписки',
                description:
                    'Здесь вы можете увидеть пользователей, на которых вы подписаны.'
            },
            FollowersPage: {
                title: 'Подписчики',
                description:
                    'Здесь вы можете увидеть пользователей, которые подписаны на вас.'
            },
            RulesPage: {
                title: 'Правила Платформы и публикации'
            },
            PrivacyPage: {
                title: 'Политика конфиденциальности'
            },
            GreetingPage: {
                welcome: 'Добро пожаловать!',
                description: 'Выберите, куда хотите перейти:',
                recipes: 'Посмотреть рецепты',
                mealPlans: 'Посмотреть планы питания',
                createRecipe: 'Создать новый рецепт',
                createPlan: 'Создать новый план питания',
                createRecipeTooltip:
                    'Подтвердите свой email, чтобы создать рецепт',
                createPlanTooltip:
                    'У вас должен быть платный план "Стандарт", чтобы создать план питания',
                mealPlansTooltip:
                    'У вас должен быть платный план "Базовый", чтобы получить доступ к планам питания'
            },
            ProfilePage: {
                socialNetworks: 'Социальные сети:',
                myRecipes: 'Мои рецепты',
                myMealPlans: 'Мои планы питания'
            },
            ProfileSettingsPage: {
                title: 'Настройки профиля',
                resendEmailTitle: 'Отправить письмо с подтверждением',
                resendEmailDescription:
                    'Отправьте письмо с подтверждением на ваш email',
                resendEmailButton: 'Отправить письмо',
                changeLanguageTitle: 'Изменить язык',
                changeLanguageDescription: 'Измените язык интерфейса на другой',
                changeLanguageButton: 'Изменить язык',
                logOut: 'Выйти',
                logOutDescription: 'Выйдите из своего аккаунта',
                logOutButton: 'Выйти',
                support: 'Поддержка',
                supportDescription:
                    'Свяжитесь с нами, если у вас возникли проблемы',
                contactSupport: 'Связаться с поддержкой',
                rules: 'Правила использования и конфиденциальность',
                rulesDescription:
                    'Ознакомьтесь с правилами использования и политикой конфиденциальности перед созданием рецепта, плана питания или использованием платформы.',
                rulesButton: 'Читать правила',
                pricing: 'Цены',
                pricingDescription: 'Посмотреть цены на наши услуги',
                pricingAction: 'Посмотреть цены',
                changePassword: 'Изменить пароль',
                passwordDescription: 'Измените пароль для вашей учетной записи',
                changePasswordButton: 'Изменить пароль',
                deleteAccount: 'Удалить учетную запись',
                deleteDescription: 'Удалите свою учетную запись навсегда',
                deleteButton: 'Удалить учетную запись'
            },
            CreateRecipePage: {
                title: 'Вдохните жизнь в свой рецепт',
                titleAI:
                    'Позвольте нашему чат-боту вдохновить ваш следующий обед',
                description:
                    'Создайте уникальный рецепт сами или доверьтесь нашему чат-боту.',
                descriptionAI:
                    'Напишите название блюда или перечислите ингредиенты, и получите персональный рецепт от нашего чат-бота.',
                tabAI: 'Создать с помощью чат-бота',
                tabManually: 'Создать вручную'
            },
            SearchProfilePage: {
                title: 'Поиск профиля',
                description: 'Найдите пользователя по никнейму в TastyTalks.'
            },
            NotFoundPage: {
                notFound: '404',
                oops: 'Упс! Кажется, эта страница исчезла как горячий пирожок. Давайте вернёмся на главную и найдём что-нибудь вкусное!',
                goHome: 'На главную'
            },
            PricingPage: {
                title: 'Гибкие тарифы для каждого',
                description:
                    'Откройте все возможности платформы, выбрав подходящий тарифный план. Зарегистрируйтесь сейчас, чтобы улучшить свой опыт и получить доступ ко всем премиальным функциям, инструментам и эксклюзивному контенту.'
            },
            Header: {
                brand: 'TastyTalks',
                signOut: 'Выйти',
                signIn: 'Войти',
                home: 'На главную',
                registerFinish: 'Завершить регистрацию',
                allRecipes: 'Все рецепты',
                allMealPlans: 'Все планы питания',
                searchProfiles: 'Поиск профиля',
                pricing: 'Тарифы'
            },
            Footer: {
                allRights: '© 2025 TastyTalks. Все права защищены.',
                profile: 'Ваш профиль',
                signOut: 'Выйти',
                createRecipe: 'Создать рецепт',
                createMealPlan: 'Создать план питания'
            },
            AuthErrors: {
                invalidEmail: 'Неверный email.',
                userDisabled: 'Этот аккаунт отключен.',
                userNotFound: 'Пользователь с таким email не найден.',
                wrongPassword: 'Неверный пароль.',
                invalidCredential: 'Предоставлены неверные учетные данные.',
                popupClosedByUser: 'Процесс входа отменен пользователем.',
                usernameOrPasswordNotFound:
                    'Неверный логин или пароль. Пожалуйста, попробуйте снова.',
                emailInUse:
                    'Этот email уже используется. Пожалуйста, попробуйте другой email.',
                emailRegistered:
                    'Этот email уже зарегистрирован. Пожалуйста, войдите или восстановите пароль.'
            },
            UsernameInput: {
                username: 'Имя пользователя',
                chooseUsername: 'Выберите имя пользователя',
                checking: 'Проверка...',
                available: 'Доступно',
                taken: 'Занято'
            },
            Forms: {
                LoginForm: {
                    actionSignUp: 'Зарегистрироваться',
                    signIn: 'Войти',
                    dontHaveAccount: 'У вас еще нет аккаунта?',
                    emailOrUsername: 'Email или имя пользователя',
                    emailOrUsernamePlaceholder:
                        'Введите ваш email или имя пользователя',
                    password: 'Пароль',
                    requiredField: 'Это поле обязательно',
                    emailNotValid: 'Email не валидный',
                    passwordMinLength: 'Пароль должен быть не менее 6 символов',
                    signInWithGoogle: 'Войти через Google',
                    forgotPassword: 'Забыли пароль?'
                },
                RegisterForm: {
                    signUp: 'Регистрация',
                    email: 'Email',
                    username: 'Имя пользователя',
                    firstName: 'Имя',
                    lastName: 'Фамилия',
                    password: 'Пароль',
                    confirmPassword: 'Подтвердите пароль',
                    usernameInvalid:
                        'Имя пользователя может содержать только буквы, цифры и подчеркивания',
                    usernameMustContainLetter:
                        'Имя пользователя должно содержать хотя бы одну букву',
                    firstNameInvalid: 'Имя может содержать только буквы',
                    lastNameInvalid: 'Фамилия может содержать только буквы',
                    passwordComplexity:
                        'Пароль должен содержать как минимум одну букву и одну цифру',
                    actionSignIn: 'Войти',
                    firstNameMinLength: 'Имя должно быть не менее 2 символа',
                    firstNameMaxLength: 'Имя должно быть не более 16 символов',
                    usernameMinLength:
                        'Имя пользователя должно быть не менее 4 символов',
                    usernameMaxLength:
                        'Имя пользователя должно быть не более 16 символов',
                    lastNameMinLength: 'Фамилия должна быть не менее 2 символа',
                    lastNameMaxLength:
                        'Фамилия должно быть не более 16 символов',
                    requiredField: 'Это поле обязательно',
                    emailNotValid: 'Email не валидный',
                    emailMinLength: 'Email должен быть не менее 6 символов',
                    emailMaxLength: 'Email должен быть не более 50 символов',
                    passwordMinLength: 'Пароль должен быть не менее 6 символов',
                    passwordsMustMatch: 'Пароли должны совпадать',
                    enterYourEmail: 'Введите ваш email',
                    enterYourName: 'Введите ваше имя',
                    enterYourLastName: 'Введите вашу фамилию',
                    haveAccount: 'Уже есть аккаунт?',
                    registerFinish: 'Завершите процесс регистрации'
                },
                EditProfileForm: {
                    firstName: 'Имя',
                    lastName: 'Фамилия',
                    username: 'Имя пользователя',
                    email: 'Email',
                    nameCheckboxLabel: 'Отображать имя и фамилию в профиле',
                    countryCheckboxLabel: 'Отображать страну в профиле',
                    usernameInvalid:
                        'Имя пользователя может содержать только буквы, цифры и подчеркивания',
                    usernameMustContainLetter:
                        'Имя пользователя должно содержать хотя бы одну букву',
                    firstNameInvalid: 'Имя может содержать только буквы',
                    lastNameInvalid: 'Фамилия может содержать только буквы',
                    firstNameMinLength: 'Имя должно быть не менее 2 символа',
                    firstNameMaxLength: 'Имя должно быть не более 16 символов',
                    usernameMinLength:
                        'Имя пользователя должно быть не менее 4 символов',
                    usernameMaxLength:
                        'Имя пользователя должно быть не более 16 символов',
                    lastNameMinLength: 'Фамилия должна быть не менее 2 символа',
                    lastNameMaxLength:
                        'Фамилия должно быть не более 16 символов',
                    requiredField: 'Это поле обязательно',
                    personalInfo: 'Личная информация',
                    additionalInfo: 'Дополнительная информация',
                    bio: 'О себе',
                    bioMaxLength: 'Максимум 200 символов',
                    country: 'Страна',
                    selectCountry: 'Выберите страну',
                    socialNetworks: 'Социальные сети',
                    socialNetworksDescription:
                        '(Добавьте ссылки на ваши социальные сети чтобы другие пользователи могли узнать больше о вас)',
                    socialNetworkName: 'Название соц. сети',
                    socialNetworkNameMinLength:
                        'Название соц. сети должно быть не менее 2 символов',
                    socialNetworkNameMaxLength:
                        'Название соц. сети должно быть не более 16 символов',
                    socialNetworkProfileNameMinLength:
                        'Имя профиля должно быть не менее 2 символов',
                    socialNetworkProfileNameMaxLength:
                        'Имя профиля должно быть не более 16 символов',
                    socialNetworkUsername: 'Имя профиля',
                    socialNetworkPlaceholder: 'Например: Youtube',
                    socialNetworkUsernamePlaceholder: 'Например: @tasty_talks',
                    socialNetworkNameRequired: 'Название соц. сети обязательно',
                    socialNetworkUsernameRequired: 'Это поле обязательно',
                    maxSocialNetworks: 'Максимум 5 соц. сетей',
                    addSocialNetwork: 'Добавить соц. сеть',
                    save: 'Сохранить изменения',
                    successMessage: 'Изменения сохранены'
                },
                ChangePasswordForm: {
                    description:
                        'Введите ваш текущий пароль и выберите новый пароль.',
                    currentPassword: 'Текущий пароль',
                    newPassword: 'Новый пароль',
                    confirmNewPassword: 'Подтвердите новый пароль',
                    passwordMinLength:
                        'Пароль должен быть не менее 6 символов.',
                    passwordsMustMatch: 'Пароли должны совпадать.',
                    requiredField: 'Это поле обязательно',
                    cancel: 'Отмена',
                    change: 'Изменить пароль',
                    successMessage:
                        'Ваш пароль успешно изменен. Пожалуйста, войдите снова.'
                },
                DeleteAccountForm: {
                    description:
                        'Вы уверены, что хотите удалить свою учетную запись? Это действие нельзя отменить.',
                    email: 'Email',
                    password: 'Пароль',
                    confirmPassword: 'Подтвердите пароль',
                    invalidEmail: 'Неверный email.',
                    passwordMinLength: 'Пароль должен быть не менее 6 символов',
                    passwordsMustMatch: 'Пароли должны совпадать',
                    requiredField: 'Это поле обязательно',
                    cancel: 'Отмена',
                    delete: 'Удалить',
                    successMessage:
                        'Ваша учетная запись успешно удалена. Мы будем скучать по вам!'
                },
                CreateRecipeWithAIForm: {
                    label: 'Что потребуется для блюда?',
                    tooShort: 'Запрос слишком короткий',
                    tooLong: 'Запрос слишком длинный',
                    placeholder:
                        'Напишите название блюда или перечислите ингредиенты. Например: у меня есть 2 яйца и немного молока, что я могу приготовить с этим?...',
                    find: 'Найти рецепт',
                    requiredField: 'Это поле обязательно',
                    saveRecipe: 'Сохранить рецепт',
                    saveRecipeDescription: 'Сохранить рецепт в своем профиле',
                    tryAnother: 'Попробовать другой рецепт',
                    tryAnotherDescription:
                        'Удалить текущий рецепт и начать заново',
                    disclaimer:
                        'Обратите внимание: сгенерированные данные могут содержать ошибки. Используйте их с осторожностью. Мы не несем ответственности за их использование.'
                },
                CreateRecipeManuallyForm: {
                    requiredField: 'Это поле обязательно',
                    min: 'Минимум 3 символа',
                    max: 'Максимум 50 символов',
                    invalidCookingTime: 'Пожалуйста, введите число от 1 до 999',
                    title: 'Название рецепта',
                    difficulty: 'Сложность приготовления',
                    difficultyPlaceholder: 'Выберите сложность',
                    categories: 'Категории',
                    categoriesPlaceholder: 'Выберите категории',
                    cookingTime:
                        'Приблизительное время приготовления (в минутах)',
                    cookingTimePlaceholder: 'Введите время приготовления',
                    description: 'Описание',
                    descriptionPlaceholder:
                        'Опишите рецепт, чтобы другие пользователи могли понять, почему он уникален или интересен',
                    descriptionHelpText:
                        'Описание помогает другим пользователям понять, чем ваш рецепт особенный. Это может быть ваша личная находка, семейный секрет или просто идея, которую вы хотите передать!',
                    previewPhotoPlaceholder:
                        'Перетащите фото сюда или нажмите для загрузки',
                    previewPhotoHelpText:
                        'Загрузите фотографию, которая станет превью вашего рецепта. Она поможет другим пользователям понять, как выглядит блюдо, и сделает ваш рецепт привлекательнее!',
                    invalidFileType:
                        'Неверный тип файла. Пожалуйста, загрузите изображение в формате JPG, JPEG, PNG, WEBP',
                    fileTooLarge:
                        'Файл слишком большой. Максимальный размер файла - 5 МБ',
                    maxIngredients: 'Максимум 30 ингредиентов',
                    ingredient: 'Ингредиент',
                    ingredientPlaceholder: 'Введите ингредиент',
                    addIngredient: 'Добавить ингредиент',
                    ingredientsCategory: 'Категория ингредиентов',
                    addCategoryIngredients: 'Добавить категорию ингредиентов',
                    categoryIngredientsPlaceholder:
                        'Введите категорию ингредиентов',
                    subIngredientPlaceholder: 'Введите ингредиент',
                    addSubIngredient: 'Добавить ингредиент в категорию',
                    subIngredient: 'Ингредиент в категории',
                    step: 'Шаг',
                    stepPlaceholder: 'Введите шаг',
                    maxSteps: 'Максимум 20 шагов',
                    addStep: 'Добавить шаг',
                    tip: 'Совет',
                    tipPlaceholder: 'Введите совет',
                    maxTips: 'Максимум 10 советов',
                    addTip: 'Добавить совет',
                    warning: 'Предостережение',
                    warningPlaceholder: 'Введите предостережение',
                    maxWarnings: 'Максимум 10 предостережений',
                    addWarning: 'Добавить предостережение',
                    videoUrl: 'Ссылка на видео',
                    invalidUrl: 'Неверная ссылка',
                    videoUrlPlaceholder: 'https://example.com',
                    videoUrlPhotoHelpText:
                        'Добавьте ссылку на видео(YouTube), чтобы пользователи могли лучше понять процесс приготовления. Видео помогает сделать рецепт более понятным и вдохновляет других попробовать его приготовить!',
                    previewRecipe: 'Предпросмотр рецепта'
                },
                ForgotPasswordForm: {
                    email: 'Email',
                    emailPlaceholder: 'Введите ваш email',
                    emailNotValid: 'Email не валидный',
                    requiredField: 'Это поле обязательно',
                    resetPassword: 'Сбросить пароль',
                    successMessage:
                        'Письмо для сброса пароля отправлено на ваш email',
                    errorMessage:
                        'Что-то пошло не так. Пожалуйста, попробуйте снова.'
                }
            },
            Modals: {
                SupportModal: {
                    title: 'Поддержка и контакты',
                    description:
                        'Если у вас есть вопросы или проблемы, свяжитесь с нами',
                    contactTitle: 'Связаться с нами',
                    contactDescription:
                        'Для общих вопросов и предложений, свяжитесь с нами',
                    advertisingTitle: 'Реклама',
                    advertisingDescription:
                        'Для вопросов о рекламе, свяжитесь с нами'
                },
                ChangePasswordModal: {
                    title: 'Изменить пароль'
                },
                DeleteAccountModal: {
                    title: 'Удалить учетную запись'
                },
                RulesAndPrivacyModal: {
                    title: 'Правила использования и конфиденциальность'
                },
                RegisterRulesAndPrivacyModal: {
                    title: 'Правила использования и конфиденциальность',
                    check: 'Я ознакомился(ась) и принимаю'
                },
                ResetStepperModal: {
                    title: 'Сбросить процесс создания рецепта',
                    description:
                        'Вы уверены, что хотите сбросить процесс создания рецепта? Все введенные данные будут потеряны.',
                    reset: 'Сбросить',
                    cancel: 'Отмена'
                },
                RecipePreviewModal: {
                    title: 'Просмотр рецепта'
                },
                StepperWelcomeModal: {
                    title: 'Добро пожаловать в создание рецепта!',
                    description:
                        'Перед вами пошаговый мастер, который поможет вам создать уникальный рецепт. Всего 9 шагов, некоторые из них обязательные, другие — опциональные.',
                    stepsTitle: 'Список шагов:',
                    doNotShowAgain: 'Не показывать это сообщение снова'
                },
                VisibilityModal: {
                    recipeTitle: 'Выберите, кто может видеть рецепт',
                    recipeCheckboxAll:
                        'Если выбрано, ваш рецепт будет виден всем пользователям, включая подписчиков и тех, кто не подписан.',
                    recipeCheckboxNobody:
                        'Если выбрано, только вы сможете видеть этот рецепт. Никто другой не будет иметь доступ.',
                    recipeCheckboxSelected:
                        'Если выбрано, рецепт будет виден только тем подписчикам, которых вы выберете из списка.',
                    mealPlanTitle: 'Выберите, кто может видеть план питания',
                    mealPlanCheckboxAll:
                        'Если выбрано, ваш план питания будет виден всем пользователям, включая подписчиков и тех, кто не подписан.',
                    mealPlanCheckboxNobody:
                        'Если выбрано, только вы сможете видеть этот план питания. Никто другой не будет иметь доступ.',
                    mealPlanCheckboxSelected:
                        'Если выбрано, план питания будет виден только тем подписчикам, которых вы выберете из списка.',
                    everyone: 'Все',
                    noone: 'Никто',
                    selectFriends: 'Выберите друзей'
                },
                ForgotPasswordModal: {
                    title: 'Забыли пароль?',
                    description: 'Введите ваш email, чтобы сбросить пароль.'
                }
            },
            PhotoUpload: {
                profilePhoto: 'Фото профиля',
                addPhoto: 'Добавить фото',
                profilePreview: 'Превью профиля',
                uploadProfilePicture: 'Загрузить фото профиля',
                deleteProfilePicture: 'Удалить фото профиля'
            },
            Recipe: {
                difficulty: 'Сложность:',
                categories: 'Категории:',
                ingredients: 'Ингредиенты:',
                steps: 'Шаги приготовления:',
                time: 'Время приготовления:',
                video: 'Видео',
                cookingTime:
                    'Приготовление блюда займет около <b>~{{count}} минут.</b>',
                tips: 'Советы:',
                warnings: 'Предостережения:',
                generated: 'Создан при помощи чат-бота',
                user: 'Создан вручную'
            },
            Stepper: {
                back: 'Назад',
                skip: 'Пропустить',
                next: 'Далее',
                submit: 'Завершить',
                backToFinalStep: 'Вернуться к последнему шагу',
                completeStep: 'Завершить шаг',
                checkStep: 'Проверить шаг',
                incompleteStep: 'Шаг не завершен',
                completed: 'Завершено',
                step: 'Шаг',
                Steps: {
                    Recipe: {
                        '1': {
                            title: 'Название и параметры',
                            description:
                                'Шаг 1: Введите название рецепта, выберите сложность, категории и укажите примерное время приготовления.'
                        },
                        '2': {
                            title: 'Описание рецепта',
                            description:
                                'Шаг 2: Опишите рецепт, чтобы другие пользователи могли понять, почему он уникален или интересен.'
                        },
                        '3': {
                            title: 'Добавьте фото',
                            description:
                                'Шаг 3: Загрузите изображение, которое будет использоваться как превью рецепта.'
                        },
                        '4': {
                            title: 'Ингредиенты',
                            description:
                                'Шаг 4: Укажите список всех ингредиентов, необходимых для приготовления рецепта.'
                        },
                        '5': {
                            title: 'Этапы приготовления',
                            description:
                                'Шаг 5: Опишите шаги, которые нужно выполнить, чтобы приготовить блюдо.'
                        },
                        '6': {
                            title: 'Советы',
                            description:
                                'Шаг 6: Добавьте полезные советы, которые помогут улучшить процесс приготовления.'
                        },
                        '7': {
                            title: 'Предостережения',
                            description:
                                'Шаг 7: Укажите важные предостережения, например, возможные аллергены или особенности рецепта.'
                        },
                        '8': {
                            title: 'Видео',
                            description:
                                'Шаг 8: Добавьте ссылку на видео(YouTube), показывающее, как готовить блюдо.'
                        },
                        '9': {
                            title: 'Подтверждение',
                            description:
                                'Шаг 9: Просмотрите введенные данные, чтобы убедиться, что всё правильно, перед публикацией рецепта.'
                        }
                    },
                    MealPlan: {}
                }
            },
            Categories: {
                dishType: 'Типы блюд',
                worldCuisine: 'Мировая кухня',
                dietaryPreference: 'Диетические предпочтения',
                cookingFeatures: 'Особенности приготовления',
                spiciness: 'Острота',
                DishType: {
                    breakfast: 'Завтраки',
                    soups: 'Супы',
                    salads: 'Салаты',
                    main_dishes: 'Основные блюда',
                    side_dishes: 'Гарниры',
                    desserts: 'Десерты',
                    baking: 'Выпечка',
                    drinks: 'Напитки',
                    snacks: 'Закуски',
                    sauces: 'Соусы и дипы'
                },
                WorldCuisine: {
                    italian: 'Итальянская кухня',
                    asian: 'Азиатская кухня',
                    french: 'Французская кухня',
                    american: 'Американская кухня',
                    ukrainian: 'Украинская кухня',
                    russian: 'Русская кухня',
                    mediterranean: 'Средиземноморская кухня',
                    eastern: 'Восточная кухня',
                    latin: 'Латиноамериканская кухня'
                },
                DietaryPreference: {
                    vegetarian: 'Вегетарианское',
                    vegan: 'Веганское',
                    gluten_free: 'Безглютеновое',
                    sugar_free: 'Без сахара',
                    for_allergy_sufferers: 'Для аллергиков',
                    lent: 'Постное'
                },
                CookingFeatures: {
                    quick: 'Быстрое (до 15 минут)',
                    medium: 'Среднее (15-60 минут)',
                    long: 'Долгое (более 60 минут)',
                    budget: 'Экономичное',
                    beginner_friendly: 'Для начинающих',
                    kids_friendly: 'Детское меню',
                    party: 'Для праздника'
                },
                Spiciness: {
                    spicy: 'Острое',
                    medium_spicy: 'Средне острое',
                    not_spicy: 'Не острое'
                }
            },
            MultiSelect: {
                showCategories: 'Показать категории',
                hideCategories: 'Скрыть категории',
                chooseCategories: 'Выберите категории',
                chosenCategories: 'Выбранные категории'
            },
            ErrorBoundary: {
                imageAlt: 'Иллюстрация ошибки',
                title: 'Что-то пошло не так',
                description:
                    'Мы столкнулись с неожиданной ошибкой. Попробуйте обновить страницу или вернуться на главную.',
                reloadButton: 'Обновить страницу',
                homeButton: 'На главную'
            },
            ProfileStats: {
                recipes: 'Рецепты',
                mealPlans: 'Планы питания',
                followers: 'Подписчики',
                following: 'Подписки',
                million: 'млн',
                thousand: 'тыс',
                tooltip:
                    'Создавайте и управляйте планами питания! Оформите любой платный план, чтобы получить доступ.'
            },
            Pricing: {
                title: 'Наши тарифные планы',
                yourPlan: 'Ваш текущий план',
                free: {
                    title: 'Бесплатный',
                    price: 'Бесплатно',
                    feature1: 'Доступ к 10 рецептам',
                    feature2: 'Основные функции сообщества',
                    feature3: 'Ограниченная поддержка',
                    button: 'Получить Бесплатно'
                },
                basic: {
                    title: 'Базовый',
                    price: '5$/месяц',
                    feature1: 'Доступ к 50 рецептам',
                    feature2: 'Базовые планы питания',
                    feature3: 'Поддержка сообщества',
                    button: 'Выбрать Базовый'
                },
                standard: {
                    title: 'Стандарт',
                    price: '10$/месяц',
                    feature1: 'Доступ к 200 рецептам',
                    feature2: 'Стандартные планы питания',
                    feature3: 'Приоритетная поддержка',
                    button: 'Выбрать Стандарт'
                },
                premium: {
                    title: 'Премиум',
                    price: '20$/месяц',
                    feature1: 'Неограниченный доступ к рецептам',
                    feature2: 'Индивидуальные планы питания',
                    feature3: 'Личная консультация',
                    button: 'Выбрать Премиум'
                }
            },
            Rules: {
                description:
                    'Пожалуйста, внимательно ознакомьтесь с правилами сообщества TastyTalks перед публикацией контента (рецептов и планов питания) и использованием информации, предоставленной другими пользователями или ИИ:',
                rule1: 'Уважайте других участников сообщества. Оскорбительный или дискриминационный язык запрещен.',
                rule2: 'Не публикуйте личную или конфиденциальную информацию о себе или других.',
                rule3: 'Убедитесь, что рецепты и планы питания, которые вы публикуете, не нарушают авторские права.',
                rule4: 'Не публикуйте вводящие в заблуждение или вредные советы по питанию. Всегда консультируйтесь с профессионалами по медицинским и диетическим вопросам.',
                rule5: 'Сообщайте администраторам о неподобающем или вредном контенте.',
                rule6: 'Платформа не несет ответственности за точность информации, публикуемой пользователями. Используйте рецепты и советы по питанию на свое усмотрение.',
                rule7: 'Платформа не гарантирует, что советы по питанию или здоровью подходят для ваших нужд. Всегда консультируйтесь с сертифицированным специалистом перед изменением диеты.',
                rule8: 'Платформа не может быть использована для незаконных действий, таких как спам, мошенничество или вредоносное ПО.',
                rule9: 'Запрещено массовое продвижение и реклама без предварительного согласования с администрацией.',
                rule10: 'Пользователи несут ответственность за законность и точность публикуемого контента.',
                rule11: 'Администрация оставляет за собой право удалять аккаунты за нарушение правил.',
                rule12: 'Использование Платформы разрешено только лицам старше 13 лет. Для лиц младше 18 лет требуется согласие родителей или опекунов.',
                rule13: 'Пользователи обязаны соблюдать законы своей страны при использовании Платформы.',
                rule14: 'Администрация оставляет за собой право изменять правила и уведомлять пользователей об изменениях.',
                rule15: 'Пользователи могут добавлять ссылки на внешние ресурсы, такие как YouTube-видео и профили в социальных сетях, только если они имеют право на их публикацию. Администрация оставляет за собой право удалять ссылки, нарушающие правила платформы или законы.'
            },
            Privacy: {
                description:
                    'Пожалуйста, внимательно ознакомьтесь с нашей Политикой конфиденциальности, которая описывает, как мы собираем, используем и защищаем ваши данные.',
                rule1: 'Мы собираем личную информацию, такую как имя, email и данные аккаунта, только с вашего согласия.',
                rule2: 'Мы используем собранные данные для регистрации, авторизации, отправки уведомлений и улучшения работы платформы.',
                rule3: 'Мы используем cookie-файлы для анализа поведения пользователей и персонализации контента.',
                rule4: 'Ваши данные хранятся в защищённых системах и не передаются третьим лицам без вашего согласия.',
                rule5: 'Вы можете запросить доступ к своим данным, их удаление или изменение в любое время.',
                rule6: 'Данные хранятся не дольше, чем это необходимо для выполнения целей их обработки.',
                rule7: 'Платформа предназначена для пользователей старше 13 лет. Для детей младше 18 лет требуется согласие родителей или опекунов.',
                rule8: 'Мы оставляем за собой право изменять Политику конфиденциальности и уведомлять пользователей об изменениях.',
                rule9: 'При добавлении ссылок на внешние ресурсы (например, YouTube-видео или профили в соцсетях), администрация не собирает и не обрабатывает данные, содержащиеся в этих ссылках. Пользователи несут ответственность за их корректность и законность.'
            },
            RulesAndPrivacy: {
                description:
                    'Пожалуйста, ознакомьтесь с правилами платформы и политикой конфиденциальности перед продолжением.',
                rulesLabel: 'Правила использования:',
                rulesLink: 'Читать правила',
                privacyLabel: 'Политика конфиденциальности:',
                privacyLink: 'Читать политику конфиденциальности'
            },
            IFrameWarning: {
                openInBrowser: 'Открыть в браузере',
                description1:
                    'Этот контент не может быть отображен внутри приложения или Телеграм.',
                description2:
                    'Пожалуйста, откройте его в браузере, нажав на кнопку ниже.'
            },
            General: {
                ok: 'Ок',
                loading: 'Загрузка...',
                error: 'Ошибка:',
                close: 'Закрыть',
                cancel: 'Отмена',
                somethingWentWrong: 'Что-то пошло не так, попробуйте позже',
                notAvailable: 'Недоступно',
                yourQueryTitle: 'Ваш запрос',
                invalidYouTubeUrl: 'Неверная ссылка на YouTube',
                easy: 'Легко',
                medium: 'Средне',
                hard: 'Сложно',
                search: 'Поиск...',
                removePhoto: 'Удалить фото',
                profilePhoto: 'Фото профиля',
                noImage: 'Нет фото',
                settings: 'Настройки',
                confirm: 'Подтвердить',
                selectAll: 'Выбрать всеx',
                apply: 'Применить',
                noResultsFound: 'Ничего не найдено',
                back: 'Назад',
                follow: 'Подписаться',
                unfollow: 'Отписаться',
                clickHere: 'Нажмите сюда',
                or: 'Или',
                selected: 'Выбрано'
            }
        }
    }
};
